// 4.2 예제로 이벤트 핸들링 익히기
// 앞으로의 이벤트 핸들링 실습 단계
// 컴포 생성 및 불러오기 -> onChange 이벤트 핸들링하기 -> 임의 메서드 만들기 -> input 여러개 다루기 -> onKeyPress 이벤트 핸들링하기

// 4.2.1 컴포넌트 생성 (* EventPractice.js 참조)
// EventPractice 컴포넌트 생성 (클래스형 컴토넌트로 우선 생성 할것)

// 4.2.3 임의 메서드 만들기 (* EventPractice.js 참조)
/********************************************************************
    노트
    메서드 이름은 마음대로 정해도 되지만 규칙을 정하면 보기 편하기 때문에
    실습을 하는 과정에서 이벤트를 핸들링하는 메서드명은 handle____ 형식으로 한다.
 ********************************************************************/

// 4.2.4 input 여러개 다루기 (* EventPractice.js 참조)

